##########################################################################
############################# Telegram logs ##############################
##########################################################################

# Токен от телеграм бота.
TG_TOKEN = ""

# ID от аккаунтов телеграм, которым нужно отсылать телеграм логи.
TG_IDS = []

# Eсли хотите получать логи в телеграм: True, а если нет: False.
USE_TG_BOT = False

##########################################################################
################################## Proxy #################################
##########################################################################

# Eсли используете мобильные прокси: True и USE_PROXY = True, а если нет: False.
USE_MOBILE_PROXY = False

# Ссылка на смену ip адреса мобильных прокси.
PROXY_CHANGE_IP_URL = ""

##########################################################################
########################### Основные настройки ###########################
##########################################################################

# Время ожидания после успешного бриджа
WALLET_DELAY_RANGE = [30, 100]

# Время ожидания после неуспешного бриджа
AFTER_FAIL_DELAY_RANGE = [10, 15]

# Сеть, из которой будет делаться бридж
# доступные сети: "Arbitrum", "Optimism", "Base", "Linea", "Scroll"
SRC_CHAIN = ""

# Сети, в которую будет делаться бридж
DST_CHAIN = ""

# Режим бриджа ("BUS" или "TAXI")
STARGATE_BRIDGE_MODE = "BUS"

# Процент от баланса, который будет забриджен
# Игнорируется, если USE_FULL_BRIDGE = True
BALANCE_PERCENTAGE_TO_BRIDGE = [0, 0]

# Включать ли все комиссии в сумме бриджа
INCLUDE_FEES_IN_AMOUNT = False

# Использование всего баланса для бриджа (True/False)
USE_FULL_BRIDGE = False

##########################################################################
##################### RPC (заполнить для всех сетей) #####################
##########################################################################

MAINNET_RPC_URL = "https://rpc.ankr.com/eth"
ARBITRUM_RPC_URL = "https://rpc.ankr.com/arbitrum"
OPTIMISM_RPC_URL = "https://rpc.ankr.com/optimism"
LINEA_RPC_URL = "https://rpc.linea.build"  # обязательно сменить эту RPC в случае использования сети Linea
SCROLL_RPC_URL = "https://rpc.ankr.com/scroll"
BASE_RPC_URL = "https://rpc.ankr.com/base"
